benchmaks/deno-oak.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      5
Time taken for tests:   0.011 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      1520 bytes
HTML transferred:       120 bytes
Requests per second:    884.49 [#/sec] (mean)
Time per request:       5.653 [ms] (mean)
Time per request:       1.131 [ms] (mean, across all concurrent requests)
Transfer rate:          131.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2    2   1.6      2       7
Waiting:        2    2   1.6      2       7
Total:          2    3   1.6      2       7

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      7
  95%      7
  98%      7
  99%      7
 100%      7 (longest request)